frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/ast.h
#define AST_SCR_OFFSET              0x0C         /**< \brief (AST_SCR offset) Status Clear Register */
#define AST_SCR_RESETVALUE          _U(0x00000000); /**< \brief (AST_SCR reset_value) Status Clear Register */

#define AST_SCR_OVF_Pos             0            /**< \brief (AST_SCR) Overflow */
#define AST_SCR_OVF                 (_U(0x1) << AST_SCR_OVF_Pos)
#define AST_SCR_ALARM0_Pos          8            /**< \brief (AST_SCR) Alarm 0 */
#define AST_SCR_ALARM0              (_U(0x1) << AST_SCR_ALARM0_Pos)
#define AST_SCR_ALARM1_Pos          9            /**< \brief (AST_SCR) Alarm 1 */
#define AST_SCR_ALARM1              (_U(0x1) << AST_SCR_ALARM1_Pos)
#define AST_SCR_PER0_Pos            16           /**< \brief (AST_SCR) Periodic 0 */
#define AST_SCR_PER0                (_U(0x1) << AST_SCR_PER0_Pos)
#define AST_SCR_PER1_Pos            17           /**< \brief (AST_SCR) Periodic 1 */
#define AST_SCR_PER1                (_U(0x1) << AST_SCR_PER1_Pos)
#define AST_SCR_READY_Pos           25           /**< \brief (AST_SCR) AST Ready */
#define AST_SCR_READY               (_U(0x1) << AST_SCR_READY_Pos)
#define AST_SCR_CLKRDY_Pos          29           /**< \brief (AST_SCR) Clock Ready */
#define AST_SCR_CLKRDY              (_U(0x1) << AST_SCR_CLKRDY_Pos)
#define AST_SCR_MASK                _U(0x22030301) /**< \brief (AST_SCR) MASK Register */

/* -------- AST_IER : (AST Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Periodic 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :7;               /*!< bit: 18..24  Reserved                           */
    uint32_t READY:1;          /*!< bit:     25  AST Ready                          */
    uint32_t :3;               /*!< bit: 26..28  Reserved                           */
    uint32_t CLKRDY:1;         /*!< bit:     29  Clock Ready                        */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_IER_OFFSET              0x10         /**< \brief (AST_IER offset) Interrupt Enable Register */
#define AST_IER_RESETVALUE          _U(0x00000000); /**< \brief (AST_IER reset_value) Interrupt Enable Register */

#define AST_IER_OVF_Pos             0            /**< \brief (AST_IER) Overflow */
#define AST_IER_OVF                 (_U(0x1) << AST_IER_OVF_Pos)
#define   AST_IER_OVF_0_Val               _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_OVF_1_Val               _U(0x1)   /**< \brief (AST_IER) Enable Interrupt. */
#define AST_IER_OVF_0               (AST_IER_OVF_0_Val             << AST_IER_OVF_Pos)
#define AST_IER_OVF_1               (AST_IER_OVF_1_Val             << AST_IER_OVF_Pos)
#define AST_IER_ALARM0_Pos          8            /**< \brief (AST_IER) Alarm 0 */
#define AST_IER_ALARM0              (_U(0x1) << AST_IER_ALARM0_Pos)
#define   AST_IER_ALARM0_0_Val            _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM0_1_Val            _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_ALARM0_0            (AST_IER_ALARM0_0_Val          << AST_IER_ALARM0_Pos)
#define AST_IER_ALARM0_1            (AST_IER_ALARM0_1_Val          << AST_IER_ALARM0_Pos)
#define AST_IER_ALARM1_Pos          9            /**< \brief (AST_IER) Alarm 1 */
#define AST_IER_ALARM1              (_U(0x1) << AST_IER_ALARM1_Pos)
#define   AST_IER_ALARM1_0_Val            _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM1_1_Val            _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_ALARM1_0            (AST_IER_ALARM1_0_Val          << AST_IER_ALARM1_Pos)
#define AST_IER_ALARM1_1            (AST_IER_ALARM1_1_Val          << AST_IER_ALARM1_Pos)
#define AST_IER_PER0_Pos            16           /**< \brief (AST_IER) Periodic 0 */
#define AST_IER_PER0                (_U(0x1) << AST_IER_PER0_Pos)
#define   AST_IER_PER0_0_Val              _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_PER0_1_Val              _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER0_0              (AST_IER_PER0_0_Val            << AST_IER_PER0_Pos)
#define AST_IER_PER0_1              (AST_IER_PER0_1_Val            << AST_IER_PER0_Pos)
#define AST_IER_PER1_Pos            17           /**< \brief (AST_IER) Periodic 1 */
#define AST_IER_PER1                (_U(0x1) << AST_IER_PER1_Pos)
#define   AST_IER_PER1_0_Val              _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_PER1_1_Val              _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER1_0              (AST_IER_PER1_0_Val            << AST_IER_PER1_Pos)
#define AST_IER_PER1_1              (AST_IER_PER1_1_Val            << AST_IER_PER1_Pos)
#define AST_IER_READY_Pos           25           /**< \brief (AST_IER) AST Ready */
#define AST_IER_READY               (_U(0x1) << AST_IER_READY_Pos)
#define   AST_IER_READY_0_Val             _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_READY_1_Val             _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_READY_0             (AST_IER_READY_0_Val           << AST_IER_READY_Pos)
#define AST_IER_READY_1             (AST_IER_READY_1_Val           << AST_IER_READY_Pos)
#define AST_IER_CLKRDY_Pos          29           /**< \brief (AST_IER) Clock Ready */
#define AST_IER_CLKRDY              (_U(0x1) << AST_IER_CLKRDY_Pos)
#define   AST_IER_CLKRDY_0_Val            _U(0x0)   /**< \brief (AST_IER) No effect */
#define   AST_IER_CLKRDY_1_Val            _U(0x1)   /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_CLKRDY_0            (AST_IER_CLKRDY_0_Val          << AST_IER_CLKRDY_Pos)
#define AST_IER_CLKRDY_1            (AST_IER_CLKRDY_1_Val          << AST_IER_CLKRDY_Pos)
#define AST_IER_MASK                _U(0x22030301) /**< \brief (AST_IER) MASK Register */

/* -------- AST_IDR : (AST Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Periodic 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :7;               /*!< bit: 18..24  Reserved                           */
    uint32_t READY:1;          /*!< bit:     25  AST Ready                          */
    uint32_t :3;               /*!< bit: 26..28  Reserved                           */
    uint32_t CLKRDY:1;         /*!< bit:     29  Clock Ready                        */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

