frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/ast.h
#define AST_IDR_OFFSET              0x14         /**< \brief (AST_IDR offset) Interrupt Disable Register */
#define AST_IDR_RESETVALUE          _U(0x00000000); /**< \brief (AST_IDR reset_value) Interrupt Disable Register */

#define AST_IDR_OVF_Pos             0            /**< \brief (AST_IDR) Overflow */
#define AST_IDR_OVF                 (_U(0x1) << AST_IDR_OVF_Pos)
#define   AST_IDR_OVF_0_Val               _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_OVF_1_Val               _U(0x1)   /**< \brief (AST_IDR) Disable Interrupt. */
#define AST_IDR_OVF_0               (AST_IDR_OVF_0_Val             << AST_IDR_OVF_Pos)
#define AST_IDR_OVF_1               (AST_IDR_OVF_1_Val             << AST_IDR_OVF_Pos)
#define AST_IDR_ALARM0_Pos          8            /**< \brief (AST_IDR) Alarm 0 */
#define AST_IDR_ALARM0              (_U(0x1) << AST_IDR_ALARM0_Pos)
#define   AST_IDR_ALARM0_0_Val            _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM0_1_Val            _U(0x1)   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_ALARM0_0            (AST_IDR_ALARM0_0_Val          << AST_IDR_ALARM0_Pos)
#define AST_IDR_ALARM0_1            (AST_IDR_ALARM0_1_Val          << AST_IDR_ALARM0_Pos)
#define AST_IDR_ALARM1_Pos          9            /**< \brief (AST_IDR) Alarm 1 */
#define AST_IDR_ALARM1              (_U(0x1) << AST_IDR_ALARM1_Pos)
#define   AST_IDR_ALARM1_0_Val            _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM1_1_Val            _U(0x1)   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_ALARM1_0            (AST_IDR_ALARM1_0_Val          << AST_IDR_ALARM1_Pos)
#define AST_IDR_ALARM1_1            (AST_IDR_ALARM1_1_Val          << AST_IDR_ALARM1_Pos)
#define AST_IDR_PER0_Pos            16           /**< \brief (AST_IDR) Periodic 0 */
#define AST_IDR_PER0                (_U(0x1) << AST_IDR_PER0_Pos)
#define   AST_IDR_PER0_0_Val              _U(0x0)   /**< \brief (AST_IDR) No effet */
#define   AST_IDR_PER0_1_Val              _U(0x1)   /**< \brief (AST_IDR) Disalbe interrupt */
#define AST_IDR_PER0_0              (AST_IDR_PER0_0_Val            << AST_IDR_PER0_Pos)
#define AST_IDR_PER0_1              (AST_IDR_PER0_1_Val            << AST_IDR_PER0_Pos)
#define AST_IDR_PER1_Pos            17           /**< \brief (AST_IDR) Periodic 1 */
#define AST_IDR_PER1                (_U(0x1) << AST_IDR_PER1_Pos)
#define   AST_IDR_PER1_0_Val              _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_PER1_1_Val              _U(0x1)   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_PER1_0              (AST_IDR_PER1_0_Val            << AST_IDR_PER1_Pos)
#define AST_IDR_PER1_1              (AST_IDR_PER1_1_Val            << AST_IDR_PER1_Pos)
#define AST_IDR_READY_Pos           25           /**< \brief (AST_IDR) AST Ready */
#define AST_IDR_READY               (_U(0x1) << AST_IDR_READY_Pos)
#define   AST_IDR_READY_0_Val             _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_READY_1_Val             _U(0x1)   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_READY_0             (AST_IDR_READY_0_Val           << AST_IDR_READY_Pos)
#define AST_IDR_READY_1             (AST_IDR_READY_1_Val           << AST_IDR_READY_Pos)
#define AST_IDR_CLKRDY_Pos          29           /**< \brief (AST_IDR) Clock Ready */
#define AST_IDR_CLKRDY              (_U(0x1) << AST_IDR_CLKRDY_Pos)
#define   AST_IDR_CLKRDY_0_Val            _U(0x0)   /**< \brief (AST_IDR) No effect */
#define   AST_IDR_CLKRDY_1_Val            _U(0x1)   /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_CLKRDY_0            (AST_IDR_CLKRDY_0_Val          << AST_IDR_CLKRDY_Pos)
#define AST_IDR_CLKRDY_1            (AST_IDR_CLKRDY_1_Val          << AST_IDR_CLKRDY_Pos)
#define AST_IDR_MASK                _U(0x22030301) /**< \brief (AST_IDR) MASK Register */

/* -------- AST_IMR : (AST Offset: 0x18) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t ALARM0:1;         /*!< bit:      8  Alarm 0                            */
    uint32_t ALARM1:1;         /*!< bit:      9  Alarm 1                            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t PER0:1;           /*!< bit:     16  Periodic 0                         */
    uint32_t PER1:1;           /*!< bit:     17  Periodic 1                         */
    uint32_t :7;               /*!< bit: 18..24  Reserved                           */
    uint32_t READY:1;          /*!< bit:     25  AST Ready                          */
    uint32_t :3;               /*!< bit: 26..28  Reserved                           */
    uint32_t CLKRDY:1;         /*!< bit:     29  Clock Ready                        */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AST_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AST_IMR_OFFSET              0x18         /**< \brief (AST_IMR offset) Interrupt Mask Register */
#define AST_IMR_RESETVALUE          _U(0x00000000); /**< \brief (AST_IMR reset_value) Interrupt Mask Register */

#define AST_IMR_OVF_Pos             0            /**< \brief (AST_IMR) Overflow */
#define AST_IMR_OVF                 (_U(0x1) << AST_IMR_OVF_Pos)
#define   AST_IMR_OVF_0_Val               _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_OVF_1_Val               _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled. */
#define AST_IMR_OVF_0               (AST_IMR_OVF_0_Val             << AST_IMR_OVF_Pos)
#define AST_IMR_OVF_1               (AST_IMR_OVF_1_Val             << AST_IMR_OVF_Pos)
#define AST_IMR_ALARM0_Pos          8            /**< \brief (AST_IMR) Alarm 0 */
#define AST_IMR_ALARM0              (_U(0x1) << AST_IMR_ALARM0_Pos)
#define   AST_IMR_ALARM0_0_Val            _U(0x0)   /**< \brief (AST_IMR) Interupt is disabled */
#define   AST_IMR_ALARM0_1_Val            _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_ALARM0_0            (AST_IMR_ALARM0_0_Val          << AST_IMR_ALARM0_Pos)
#define AST_IMR_ALARM0_1            (AST_IMR_ALARM0_1_Val          << AST_IMR_ALARM0_Pos)
#define AST_IMR_ALARM1_Pos          9            /**< \brief (AST_IMR) Alarm 1 */
#define AST_IMR_ALARM1              (_U(0x1) << AST_IMR_ALARM1_Pos)
#define   AST_IMR_ALARM1_0_Val            _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_ALARM1_1_Val            _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_ALARM1_0            (AST_IMR_ALARM1_0_Val          << AST_IMR_ALARM1_Pos)
#define AST_IMR_ALARM1_1            (AST_IMR_ALARM1_1_Val          << AST_IMR_ALARM1_Pos)
#define AST_IMR_PER0_Pos            16           /**< \brief (AST_IMR) Periodic 0 */
#define AST_IMR_PER0                (_U(0x1) << AST_IMR_PER0_Pos)
#define   AST_IMR_PER0_0_Val              _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER0_1_Val              _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER0_0              (AST_IMR_PER0_0_Val            << AST_IMR_PER0_Pos)
#define AST_IMR_PER0_1              (AST_IMR_PER0_1_Val            << AST_IMR_PER0_Pos)
#define AST_IMR_PER1_Pos            17           /**< \brief (AST_IMR) Periodic 1 */
#define AST_IMR_PER1                (_U(0x1) << AST_IMR_PER1_Pos)
#define   AST_IMR_PER1_0_Val              _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER1_1_Val              _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER1_0              (AST_IMR_PER1_0_Val            << AST_IMR_PER1_Pos)
#define AST_IMR_PER1_1              (AST_IMR_PER1_1_Val            << AST_IMR_PER1_Pos)
#define AST_IMR_READY_Pos           25           /**< \brief (AST_IMR) AST Ready */
#define AST_IMR_READY               (_U(0x1) << AST_IMR_READY_Pos)
#define   AST_IMR_READY_0_Val             _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_READY_1_Val             _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_READY_0             (AST_IMR_READY_0_Val           << AST_IMR_READY_Pos)
#define AST_IMR_READY_1             (AST_IMR_READY_1_Val           << AST_IMR_READY_Pos)
#define AST_IMR_CLKRDY_Pos          29           /**< \brief (AST_IMR) Clock Ready */
#define AST_IMR_CLKRDY              (_U(0x1) << AST_IMR_CLKRDY_Pos)
#define   AST_IMR_CLKRDY_0_Val            _U(0x0)   /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_CLKRDY_1_Val            _U(0x1)   /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_CLKRDY_0            (AST_IMR_CLKRDY_0_Val          << AST_IMR_CLKRDY_Pos)
#define AST_IMR_CLKRDY_1            (AST_IMR_CLKRDY_1_Val          << AST_IMR_CLKRDY_Pos)
#define AST_IMR_MASK                _U(0x22030301) /**< \brief (AST_IMR) MASK Register */

